In [1]:
import pandas as pd

In [4]:
data=[['juan',25],['maria',30],['pws',23]]
print(type(data))

<class 'list'>

In [5]:
df= pd.DataFrame(data, columns=['nombre','edad'])

In [6]:
df

  nombre  edad
0   juan    25
1  maria    30
2    pws    23

In [11]:
data1={'nombre':['juan','maria','pws'],'edad':[25,20,30]}

In [12]:
df1= pd.DataFrame(data1)

In [13]:
df1

  nombre  edad
0   juan    25
1  maria    20
2    pws    30

In [14]:
data3= [('juan',20),('juan1',23),('juan3',33)]

In [15]:
df2= pd.DataFrame(data3)
df2

       0   1
0   juan  20
1  juan1  23
2  juan3  33

In [17]:
df3=pd.read_csv('../data/data', sep= '|')

In [18]:
df3

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [19]:
df4=pd.read_csv('../data/data.csv')
df4

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [21]:
df5=pd.read_csv('../data/data_without_header', header= None, names=['nombre','edad','ciudad'])
df5

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [24]:
df6=pd.read_json('../data/data.json')
df6

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [25]:
df6.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [26]:
df.head(2) # o tail()

  nombre  edad
0   juan    25
1  maria    30

In [27]:
df.describe()

            edad
count   3.000000
mean   26.000000
std     3.605551
min    23.000000
25%    24.000000
50%    25.000000
75%    27.500000
max    30.000000

In [28]:
df.shape

(3, 2)

In [31]:
df[['nombre','edad']] #df['nombre] solo para uno

  nombre  edad
0   juan    25
1  maria    30
2    pws    23

In [32]:
df.loc[0]

nombre    juan
edad        25
Name: 0, dtype: object

In [33]:
df.loc[[0,2]]

  nombre  edad
0   juan    25
2    pws    23

In [37]:
df[df['edad']>23]

  nombre  edad
0   juan    25
1  maria    30

In [39]:
df.loc[0]['edad'] # un valor de cierta columna cierta fila

25

In [40]:
data1={'grupo':['a','b','a','b','a','b'],'valor':[25,20,30,10,20,40]}
data8= pd.DataFrame(data1)

In [41]:
data8

  grupo  valor
0     a     25
1     b     20
2     a     30
3     b     10
4     a     20
5     b     40

In [45]:
data8.groupby('grupo').mean()

           valor
grupo
a      25.000000
b      23.333333

In [46]:
data8.groupby('grupo').sum()

       valor
grupo
a         75
b         70